In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('stud.csv')

In [3]:
df.head()

   StudentID  Age  Gender  StudyHours  Attendance  PreviousScore FinalResult
0          1   18    Male           2          75             55        Fail
1          2   19  Female           3          80             60        Pass
2          3   20    Male           5          85             65        Pass
3          4   18  Female           1          60             45        Fail
4          5   21    Male           6          90             70        Pass

In [4]:
df.shape

(20, 7)

In [5]:
df.describe()

       StudentID        Age  StudyHours  Attendance  PreviousScore
count   20.00000  20.000000    20.00000   20.000000      20.000000
mean    10.50000  20.000000     3.60000   79.650000      61.300000
std      5.91608   1.450953     1.63514   10.989349      11.041072
min      1.00000  18.000000     1.00000   55.000000      40.000000
25%      5.75000  19.000000     2.00000   73.500000      54.250000
50%     10.50000  20.000000     3.50000   81.000000      61.000000
75%     15.25000  21.000000     5.00000   88.500000      68.500000
max     20.00000  22.000000     6.00000   95.000000      80.000000

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   StudentID      20 non-null     int64
 1   Age            20 non-null     int64
 2   Gender         20 non-null     object
 3   StudyHours     20 non-null     int64
 4   Attendance     20 non-null     int64
 5   PreviousScore  20 non-null     int64
 6   FinalResult    20 non-null     object
dtypes: int64(5), object(2)
memory usage: 1.2+ KB

In [7]:
df.isnull().sum()

StudentID        0
Age              0
Gender           0
StudyHours       0
Attendance       0
PreviousScore    0
FinalResult      0
dtype: int64

### Identify Features and Target (ML Workflow)

In [8]:
x=df.drop('FinalResult',axis=1)
y=df['FinalResult']

In [9]:
print(x.head())

   StudentID  Age  Gender  StudyHours  Attendance  PreviousScore
0          1   18    Male           2          75             55
1          2   19  Female           3          80             60
2          3   20    Male           5          85             65
3          4   18  Female           1          60             45
4          5   21    Male           6          90             70

In [10]:
print(y.head())

0    Fail
1    Pass
2    Pass
3    Fail
4    Pass
Name: FinalResult, dtype: object

In [11]:
# Ml-WorkFlow

# 1. Problem Understanding – Predict student final result
# 2. Data Collection – Student CSV dataset
# 3. Data Exploration – head(), info(), describe()
# 4. Feature Selection – Identified X and y
# 5. Data ready for Model Training (Next Day)